app/Controllers/Page.php

SELECT *
FROM `user`
---
    public function manageUser()
    {
        $userModel = new UserModel();
        $user = $userModel->findAll();