app/Controllers/UserController.php

UPDATE `user` SET `username` = 'bara', `role` = 'admin', `password` = '4a9ebbf5505657334b669ce98fa5496f', `is_aktif` = '0'
WHERE `user`.`id` IN ('3')
---
    public function edit($id)
    {
        $data = $this->request->getPost();
        $validate = $this->validation->run($data, 'user');
        $errors = $this->validation->getErrors();

        if (!$errors) {
            $dataForm = [
                'username' => $this->request->getPost('username'),
                'role' => $this->request->getPost('role'),
                'password' => $this->request->getPost('password'),
                'is_aktif' => $this->request->getPost('is_aktif')
            ];

            $this->user->update($id, $dataForm);